# encoding: UTF-8

questions = ["Если ваш партнер бросает взгляд на незнакомую женщину, вы устраиваете ему скандал прямо на улице?(да/нет)",
						"Если ваш партнер опаздывает на ужин, вы уверены, что он был с другой?(да/нет)",
						"Вы расспрашиваете его о работе, о коллегах?(да/нет)",
						"Вы считаете, что каждую свободную минуту должны проводить вместе?(да/нет)",
						"Он для вас — свет в окошке?да/нет",
						"Случается ли вам проверять его корреспонденцию и рыться в его вещах?(да/нет)",
						"Чем чаще он говорит о своих чувствах, тем меньше вы верите?(да/нет)",
						"Вы хотите, чтобы он интересовался только тем, чем интересуетесь вы?(да/нет)",
						"Вы всегда спрашиваете у него, куда он ходит и с кем встречается?(да/нет)",
						"Если вы на него обижены, то молчите по нескольку дней?(да/нет)",
						"Вас мучают мысли о его бывшей возлюбленной?(да/нет)",
						"Он утверждает, что не ревнует вас, потому что доверяет. Для вас это означает, что любовь прошла?(да/нет)"]

answers = []

arr_size = answers.size

while arr_size != 12

	questions.each_with_index do |item, i|

		puts "#{i + 1}. #{item}"
		user_answer = gets.strip

		if user_answer == 'y'
			answers << user_answer
			puts arr_size
		end
	
	end	

end
